In [9]:
import pandas as pd

s = pd.Series([10,20,30,40,50])

s

0    10
1    20
2    30
3    40
4    50
dtype: int64

In [10]:
s.dtype

dtype('int64')

In [11]:
s.values

array([10, 20, 30, 40, 50])

In [12]:
s.index

RangeIndex(start=0, stop=5, step=1)

In [13]:
print(s.name)

None

In [17]:
s.name = "numbers"
s

0    10
1    20
2    30
3    40
4    50
Name: numbers, dtype: int64

In [18]:
# indexing

s[0]

np.int64(10)

In [19]:
s[0:2]

0    10
1    20
Name: numbers, dtype: int64

In [20]:
s[2:4]

2    30
3    40
Name: numbers, dtype: int64

In [21]:
# iloc - location based indexing

s.iloc[3]

np.int64(40)

In [23]:
s.iloc[[1,3,4]]

1    20
3    40
4    50
Name: numbers, dtype: int64

In [26]:
index = ["apple","banana","grapes","orange","strawberry"]
s.index = index
s

apple         10
banana        20
grapes        30
orange        40
strawberry    50
Name: numbers, dtype: int64

In [28]:
s.name = "calories"
s

apple         10
banana        20
grapes        30
orange        40
strawberry    50
Name: calories, dtype: int64

In [29]:
s['grapes']

np.int64(30)

In [34]:
# loc -label based indexing

s.loc[['grapes','apple']]

grapes    30
apple     10
Name: calories, dtype: int64

In [33]:
# iloc for int

# loc for char
# in label based indexing your start as well as stop value both are included in the output
s['banana':'orange']

banana    20
grapes    30
orange    40
Name: calories, dtype: int64

In [38]:
# dictionaries
fruit_protein = {
    "Avocado" : 2.0,   # grams of protein
    "Guava" : 2.6,
    "Blackberries" : 2.0,
    "Oranges" : 0.9,
    "Banana" : 1.1,
    "Apples" : 0.3,
    "Kiwi" : 1.1,
    "Pomegranate" : 1.7,
    "Mango" : 0.8,
    "Cherries" : 1.0
}
s2 = pd.Series(fruit_protein, name = "protein")
s2

Avocado         2.0
Guava           2.6
Blackberries    2.0
Oranges         0.9
Banana          1.1
Apples          0.3
Kiwi            1.1
Pomegranate     1.7
Mango           0.8
Cherries        1.0
Name: protein, dtype: float64

In [39]:
# conditional indexing

s2 > 1

Avocado          True
Guava            True
Blackberries     True
Oranges         False
Banana           True
Apples          False
Kiwi             True
Pomegranate      True
Mango           False
Cherries        False
Name: protein, dtype: bool

In [40]:
s2[s2 > 1]  # inside original series

Avocado         2.0
Guava           2.6
Blackberries    2.0
Banana          1.1
Kiwi            1.1
Pomegranate     1.7
Name: protein, dtype: float64

In [42]:
# logical operators
# and, or, not

[(s2 > 0.5) & (s2 < 1)]   # and &

[Avocado         False
 Guava           False
 Blackberries    False
 Oranges          True
 Banana          False
 Apples          False
 Kiwi            False
 Pomegranate     False
 Mango            True
 Cherries        False
 Name: protein, dtype: bool]

In [45]:
s2[(s2 > 0.5) & (s2 <= 2)]  # inside original series

Avocado         2.0
Blackberries    2.0
Oranges         0.9
Banana          1.1
Kiwi            1.1
Pomegranate     1.7
Mango           0.8
Cherries        1.0
Name: protein, dtype: float64

In [47]:
s2[(s2 > 0.5 ) | (s2 <=2)]   # or | , we use or if we need all true

Avocado         2.0
Guava           2.6
Blackberries    2.0
Oranges         0.9
Banana          1.1
Apples          0.3
Kiwi            1.1
Pomegranate     1.7
Mango           0.8
Cherries        1.0
Name: protein, dtype: float64

In [49]:
# not operation

s2[~(s2 > 1)]

Oranges     0.9
Apples      0.3
Mango       0.8
Cherries    1.0
Name: protein, dtype: float64

In [52]:
# modifying the series

s2["Mango"] = 2.8
s2

Avocado         2.0
Guava           2.6
Blackberries    2.0
Oranges         0.9
Banana          1.1
Apples          0.3
Kiwi            1.1
Pomegranate     1.7
Mango           2.8
Cherries        1.0
Name: protein, dtype: float64

In [54]:
# short quiz 
import numpy as np

ser = pd.Series(['a',np.nan, 1, np.nan, 2])
s.notnull().sum()

np.int64(5)

In [55]:
# DataFrame:

data = {
    "Name" : ["Alice", "Bob", "Charlie", "David", "Eve", "Alice"],
    "Age" : [25,30,35,np.nan,29,25],
    "Department" : ["HR", "IT", "Finance", "IT", "HR", "HR"],
    "Salary" : [50000,60000,70000,62000,np.nan,50000]
}
data

{'Name': ['Alice', 'Bob', 'Charlie', 'David', 'Eve', 'Alice'],
 'Age': [25, 30, 35, nan, 29, 25],
 'Department': ['HR', 'IT', 'Finance', 'IT', 'HR', 'HR'],
 'Salary': [50000, 60000, 70000, 62000, nan, 50000]}

In [56]:
df = pd.DataFrame(data)
df

      Name   Age Department   Salary
0    Alice  25.0         HR  50000.0
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0
3    David   NaN         IT  62000.0
4      Eve  29.0         HR      NaN
5    Alice  25.0         HR  50000.0

In [58]:
df.head(2)   # wanna see first two rows

    Name   Age Department   Salary
0  Alice  25.0         HR  50000.0
1    Bob  30.0         IT  60000.0

In [59]:
df.tail(3)   # wanna see last three rows

    Name   Age Department   Salary
3  David   NaN         IT  62000.0
4    Eve  29.0         HR      NaN
5  Alice  25.0         HR  50000.0

In [65]:
# loc and iloc

df.iloc[1:3]   # loc - label based indexing

      Name   Age Department   Salary
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0

In [64]:
df.loc[1:3,["Age","Department"]]    # loc for age and department only , iloc - location based indexing

    Age Department
1  30.0         IT
2  35.0    Finance
3   NaN         IT

In [67]:
df.iloc[1:3, :2]    # rows and columns

      Name   Age
1      Bob  30.0
2  Charlie  35.0

In [69]:
# access only one particular column

df["Age"]

0    25.0
1    30.0
2    35.0
3     NaN
4    29.0
5    25.0
Name: Age, dtype: float64

In [70]:
# loc - both 
# iloc - only integers or integer slices

In [72]:
df[["Age","Department"]]

    Age Department
0  25.0         HR
1  30.0         IT
2  35.0    Finance
3   NaN         IT
4  29.0         HR
5  25.0         HR

In [73]:
df.drop("Age", axis = 1)  # drop age

      Name Department   Salary
0    Alice         HR  50000.0
1      Bob         IT  60000.0
2  Charlie    Finance  70000.0
3    David         IT  62000.0
4      Eve         HR      NaN
5    Alice         HR  50000.0

In [74]:
df

      Name   Age Department   Salary
0    Alice  25.0         HR  50000.0
1      Bob  30.0         IT  60000.0
2  Charlie  35.0    Finance  70000.0
3    David   NaN         IT  62000.0
4      Eve  29.0         HR      NaN
5    Alice  25.0         HR  50000.0

In [75]:
# by default inplace = false, so we have to put inplace = true

In [76]:
df.shape

(6, 4)

In [79]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Name        6 non-null      object
 1   Age         5 non-null      float64
 2   Department  6 non-null      object
 3   Salary      5 non-null      float64
dtypes: float64(2), object(2)
memory usage: 324.0+ bytes

In [80]:
df.describe()

             Age        Salary
count   5.000000      5.000000
mean   28.800000  58400.000000
std     4.147288   8532.291603
min    25.000000  50000.000000
25%    25.000000  50000.000000
50%    29.000000  60000.000000
75%    30.000000  62000.000000
max    35.000000  70000.000000

In [81]:
# Broadcasting

df["Salary"]

0    50000.0
1    60000.0
2    70000.0
3    62000.0
4        NaN
5    50000.0
Name: Salary, dtype: float64

In [88]:
df["Salary"] + 5000   # match the shape and size

0    55000.0
1    65000.0
2    75000.0
3    67000.0
4        NaN
5    55000.0
Name: Salary, dtype: float64

In [83]:
# Renaming a column

df.rename(columns = {"Department": "Dept"}, inplace = True)

In [84]:
df

      Name   Age     Dept   Salary
0    Alice  25.0       HR  50000.0
1      Bob  30.0       IT  60000.0
2  Charlie  35.0  Finance  70000.0
3    David   NaN       IT  62000.0
4      Eve  29.0       HR      NaN
5    Alice  25.0       HR  50000.0

In [90]:
df["Salary"].unique()    # check unique value in data for a particular column
  # check unique salary in my dataset

array([50000., 60000., 70000., 62000.,    nan])

In [91]:
df["Dept"].unique()    # unique department

array(['HR', 'IT', 'Finance'], dtype=object)

In [92]:
df["Dept"].value_counts()    # check how many employers are in which departments

Dept
HR         3
IT         2
Finance    1
Name: count, dtype: int64

In [94]:
# create new column called promoted salary

df["Promoted Salary"] = df["Salary"] * 10
df

      Name   Age     Dept   Salary  Promoted Salary
0    Alice  25.0       HR  50000.0         500000.0
1      Bob  30.0       IT  60000.0         600000.0
2  Charlie  35.0  Finance  70000.0         700000.0
3    David   NaN       IT  62000.0         620000.0
4      Eve  29.0       HR      NaN              NaN
5    Alice  25.0       HR  50000.0         500000.0

In [105]:
# Data cleaning

# option 1: drop or get rid of null values

df.isnull().sum()

Name               0
Age                1
Dept               0
Salary             1
Promoted Salary    1
dtype: int64

In [97]:
df.dropna()  # any row with null value has been removed

      Name   Age     Dept   Salary  Promoted Salary
0    Alice  25.0       HR  50000.0         500000.0
1      Bob  30.0       IT  60000.0         600000.0
2  Charlie  35.0  Finance  70000.0         700000.0
5    Alice  25.0       HR  50000.0         500000.0

In [98]:
# i have not place inplace = True ,so my original df is untouched
df

      Name   Age     Dept   Salary  Promoted Salary
0    Alice  25.0       HR  50000.0         500000.0
1      Bob  30.0       IT  60000.0         600000.0
2  Charlie  35.0  Finance  70000.0         700000.0
3    David   NaN       IT  62000.0         620000.0
4      Eve  29.0       HR      NaN              NaN
5    Alice  25.0       HR  50000.0         500000.0

In [101]:
 df.dropna(how = "any")    # its same; it remove rows with null values # any row that have any null value

      Name   Age     Dept   Salary  Promoted Salary
0    Alice  25.0       HR  50000.0         500000.0
1      Bob  30.0       IT  60000.0         600000.0
2  Charlie  35.0  Finance  70000.0         700000.0
5    Alice  25.0       HR  50000.0         500000.0

In [104]:
df.dropna(how = "all")   # if all the values in any row are null, we are going to drop that row

      Name   Age     Dept   Salary  Promoted Salary
0    Alice  25.0       HR  50000.0         500000.0
1      Bob  30.0       IT  60000.0         600000.0
2  Charlie  35.0  Finance  70000.0         700000.0
3    David   NaN       IT  62000.0         620000.0
4      Eve  29.0       HR      NaN              NaN
5    Alice  25.0       HR  50000.0         500000.0

In [114]:
# option 2: to fill those missing values

# its important
"""
fillna()

methods
1. forwardfill - top to bottom
2. backwardfill - bottom to top

"""

# df.fillna(0)  # noob
df["Age"].fillna(df["Age"].mean())    # missing value in age has been replaced by mean

0    25.0
1    30.0
2    35.0
3    28.8
4    29.0
5    25.0
Name: Age, dtype: float64

In [109]:
df["Salary"].fillna(df["Salary"].median())   # missing value in salary has been replaced by median

0    50000.0
1    60000.0
2    70000.0
3    62000.0
4    60000.0
5    50000.0
Name: Salary, dtype: float64

In [111]:
# 1. forward fill

df["Age"].fillna(method = "ffill")

C:\Users\AsH-Ok ALe\AppData\Local\Temp\ipykernel_10756\4070069302.py:3: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df["Age"].fillna(method = "ffill")

0    25.0
1    30.0
2    35.0
3    35.0
4    29.0
5    25.0
Name: Age, dtype: float64

In [112]:
# 2. backward fill

df["Age"].fillna(method = "bfill")

C:\Users\AsH-Ok ALe\AppData\Local\Temp\ipykernel_10756\687690744.py:3: FutureWarning: Series.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df["Age"].fillna(method = "bfill")

0    25.0
1    30.0
2    35.0
3    29.0
4    29.0
5    25.0
Name: Age, dtype: float64

In [113]:
# this may give error if our first and last value is null

In [116]:
# replace name with other name

df["Name"].replace("Charlie", "Rose")

0    Alice
1      Bob
2     Rose
3    David
4      Eve
5    Alice
Name: Name, dtype: object

In [118]:
df["Name"] = df["Name"].replace("Charlie","Rose")  # to replace permanently

In [119]:
df

    Name   Age     Dept   Salary  Promoted Salary
0  Alice  25.0       HR  50000.0         500000.0
1    Bob  30.0       IT  60000.0         600000.0
2   Rose  35.0  Finance  70000.0         700000.0
3  David   NaN       IT  62000.0         620000.0
4    Eve  29.0       HR      NaN              NaN
5  Alice  25.0       HR  50000.0         500000.0

In [120]:
# deal with duplicate values

# we have inbuilt function

df_dup = df[df.duplicated()]
df_dup

    Name   Age Dept   Salary  Promoted Salary
5  Alice  25.0   HR  50000.0         500000.0

In [125]:
# by default parameter is (keep = "first")

df_dup = df[df.duplicated(keep = "first")]   # top to bottom
df_dup

    Name   Age Dept   Salary  Promoted Salary
5  Alice  25.0   HR  50000.0         500000.0

In [124]:
# when we say (keep = "last"); our first element is duplicated

df_dup = df[df.duplicated(keep = "last")]    # bottom to top
df_dup

    Name   Age Dept   Salary  Promoted Salary
0  Alice  25.0   HR  50000.0         500000.0

In [127]:
# i prefer my second record to be deleted

df = df.drop_duplicates()
df

    Name   Age     Dept   Salary  Promoted Salary
0  Alice  25.0       HR  50000.0         500000.0
1    Bob  30.0       IT  60000.0         600000.0
2   Rose  35.0  Finance  70000.0         700000.0
3  David   NaN       IT  62000.0         620000.0
4    Eve  29.0       HR      NaN              NaN

In [129]:
# how to deal with invalid values

# to do changes in the column of the particular dataset
# lamda - python

df["Promoted Salary"] = df["Promoted Salary"].apply(lambda x: x/10 if x > 650000 else x)
df

    Name   Age     Dept   Salary  Promoted Salary
0  Alice  25.0       HR  50000.0         500000.0
1    Bob  30.0       IT  60000.0         600000.0
2   Rose  35.0  Finance  70000.0          70000.0
3  David   NaN       IT  62000.0         620000.0
4    Eve  29.0       HR      NaN              NaN

In [130]:

"""
this is how to split our data set

name = "alice_fernades"
df[["first_name","last_name"]] = df["name"].str.split("_")
"""

'\nthis is how to split our data set\n\nname = "alice_fernades"\ndf[["first_name","last_name"]] = df["name"].str.split("_")\n'

In [137]:
# multiply all the ages with 2

# apply and lamda

def multiplying_age(x):
    return x * 2

df["Age"] = df["Age"].apply(multiplying_age)
df

    Name     Age     Dept   Salary  Promoted Salary
0  Alice  3200.0       HR  50000.0         500000.0
1    Bob  3840.0       IT  60000.0         600000.0
2   Rose  4480.0  Finance  70000.0          70000.0
3  David     NaN       IT  62000.0         620000.0
4    Eve  3712.0       HR      NaN              NaN

In [143]:
# return to original value

df["Age"] = df["Age"].apply(lambda x: x/2)
df

    Name   Age     Dept   Salary  Promoted Salary
0  Alice  50.0       HR  50000.0         500000.0
1    Bob  60.0       IT  60000.0         600000.0
2   Rose  70.0  Finance  70000.0          70000.0
3  David   NaN       IT  62000.0         620000.0
4    Eve  58.0       HR      NaN              NaN

In [145]:
# Joins and Merges

"""
like in sets

left join - A-B  # only A
right join - B-A  # only B
outer join - AUB  # A union B
inner join - AnB  # A intersection B

merge is like inner join

"""

department_info = {
    "Department" : ["HR","IT","Finance"],
    "Location" : ["New York","San Francisco","Chicago"],
    "Manager" : ["Laura","Steve","Nina"]
}

df2 = pd.DataFrame(department_info)
df2

  Department       Location Manager
0         HR       New York   Laura
1         IT  San Francisco   Steve
2    Finance        Chicago    Nina

In [146]:
# concat - it will let me merge the information from both these dataset

pd.concat([df,df2])

,Name,Age,Dept,Salary,Promoted Salary,Department,Location,Manager
0,Alice,50.0,HR,50000.0,500000.0,NaN,NaN,NaN
1,Bob,60.0,IT,60000.0,600000.0,NaN,NaN,NaN
2,Rose,70.0,Finance,70000.0,70000.0,NaN,NaN,NaN
3,David,NaN,IT,62000.0,620000.0,NaN,NaN,NaN
4,Eve,58.0,HR,NaN,NaN,NaN,NaN,NaN
0,NaN,NaN,NaN,NaN,NaN,HR,New York,Laura
1,NaN,NaN,NaN,NaN,NaN,IT,San Francisco,Steve
2,NaN,NaN,NaN,NaN,NaN,Finance,Chicago,Nina

In [154]:
# by default both data sets are combined in a horizontal manner.

pd.concat([df,df2], axis = 1)

,Name,Age,Dept,Salary,Promoted Salary,Department,Location,Manager
0,Alice,50.0,HR,50000.0,500000.0,HR,New York,Laura
1,Bob,60.0,IT,60000.0,600000.0,IT,San Francisco,Steve
2,Rose,70.0,Finance,70000.0,70000.0,Finance,Chicago,Nina
3,David,NaN,IT,62000.0,620000.0,NaN,NaN,NaN
4,Eve,58.0,HR,NaN,NaN,NaN,NaN,NaN

In [155]:
# pd.merge(df,df2, on = "Dept")   # if there was two dept, it would be one dept

In [161]:
# importing file

# right click on your dataset and click on copy as path and
# create a variable

# data = pd.read_csv("C:\Users\..........")  , like this


# or 
# upload data on Jupyter notebook ; then in qoutes write data.csv
# data.head() ,   first five rows

In [4]:
import pandas as pd

data = pd.read_csv("Wine.csv")

data.head()

,Alcohol,Malic_Acid,Ash,Ash_Alcanity,Magnesium,Total_Phenols,Flavanoids,Nonflavanoid_Phenols,Proanthocyanins,Color_Intensity,Hue,OD280,Proline,Customer_Segment
0,14.23,1.71,2.43,15.6,127,2.80,3.06,0.28,2.29,5.64,1.04,3.92,1065,1
1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050,1
2,13.16,2.36,2.67,18.6,101,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185,1
3,14.37,1.95,2.50,16.8,113,3.85,3.49,0.24,2.18,7.80,0.86,3.45,1480,1
4,13.24,2.59,2.87,21.0,118,2.80,2.69,0.39,1.82,4.32,1.04,2.93,735,1

In [5]:
data.shape

(178, 14)

In [6]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 178 entries, 0 to 177
Data columns (total 14 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Alcohol               178 non-null    float64
 1   Malic_Acid            178 non-null    float64
 2   Ash                   178 non-null    float64
 3   Ash_Alcanity          178 non-null    float64
 4   Magnesium             178 non-null    int64
 5   Total_Phenols         178 non-null    float64
 6   Flavanoids            178 non-null    float64
 7   Nonflavanoid_Phenols  178 non-null    float64
 8   Proanthocyanins       178 non-null    float64
 9   Color_Intensity       178 non-null    float64
 10  Hue                   178 non-null    float64
 11  OD280                 178 non-null    float64
 12  Proline               178 non-null    int64
 13  Customer_Segment      178 non-null    int64
dtypes: float64(11), int64(3)
memory usage: 19.6 KB

In [8]:
data.describe()

,Alcohol,Malic_Acid,Ash,Ash_Alcanity,Magnesium,Total_Phenols,Flavanoids,Nonflavanoid_Phenols,Proanthocyanins,Color_Intensity,Hue,OD280,Proline,Customer_Segment
count,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000,178.000000
mean,13.000618,2.336348,2.366517,19.494944,99.741573,2.295112,2.029270,0.361854,1.590899,5.058090,0.957449,2.611685,746.893258,1.938202
std,0.811827,1.117146,0.274344,3.339564,14.282484,0.625851,0.998859,0.124453,0.572359,2.318286,0.228572,0.709990,314.907474,0.775035
min,11.030000,0.740000,1.360000,10.600000,70.000000,0.980000,0.340000,0.130000,0.410000,1.280000,0.480000,1.270000,278.000000,1.000000
25%,12.362500,1.602500,2.210000,17.200000,88.000000,1.742500,1.205000,0.270000,1.250000,3.220000,0.782500,1.937500,500.500000,1.000000
50%,13.050000,1.865000,2.360000,19.500000,98.000000,2.355000,2.135000,0.340000,1.555000,4.690000,0.965000,2.780000,673.500000,2.000000
75%,13.677500,3.082500,2.557500,21.500000,107.000000,2.800000,2.875000,0.437500,1.950000,6.200000,1.120000,3.170000,985.000000,3.000000
max,14.830000,5.800000,3.230000,30.000000,162.000000,3.880000,5.080000,0.660000,3.580000,13.000000,1.710000,4.000000,1680.000000,3.000000

In [9]:
data

,Alcohol,Malic_Acid,Ash,Ash_Alcanity,Magnesium,Total_Phenols,Flavanoids,Nonflavanoid_Phenols,Proanthocyanins,Color_Intensity,Hue,OD280,Proline,Customer_Segment
0,14.23,1.71,2.43,15.6,127,2.80,3.06,0.28,2.29,5.64,1.04,3.92,1065,1
1,13.20,1.78,2.14,11.2,100,2.65,2.76,0.26,1.28,4.38,1.05,3.40,1050,1
2,13.16,2.36,2.67,18.6,101,2.80,3.24,0.30,2.81,5.68,1.03,3.17,1185,1
3,14.37,1.95,2.50,16.8,113,3.85,3.49,0.24,2.18,7.80,0.86,3.45,1480,1
4,13.24,2.59,2.87,21.0,118,2.80,2.69,0.39,1.82,4.32,1.04,2.93,735,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
173,13.71,5.65,2.45,20.5,95,1.68,0.61,0.52,1.06,7.70,0.64,1.74,740,3
174,13.40,3.91,2.48,23.0,102,1.80,0.75,0.43,1.41,7.30,0.70,1.56,750,3
175,13.27,4.28,2.26,20.0,120,1.59,0.69,0.43,1.35,10.20,0.59,1.56,835,3
176,13.17,2.59,2.37,20.0,120,1.65,0.68,0.53,1.46,9.30,0.60,1.62,840,3
177,14.13,4.10,2.74,24.5,96,2.05,0.76,0.56,1.35,9.20,0.61,1.60,560,3